Finding and removing missing Values using K nearest neighbour

we convert values into numerical firstly

In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

Firstly laod dataset

In [4]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
sex              0
pclass           0
survived         0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64

Now convert all categorical values into numerical

In [6]:
from sklearn.preprocessing import LabelEncoder

columns=['sex','embarked','class','who','adult_male','deck','embark_town','alive']
label_encoders={} #dictionary to hold label encoders 4 each column

for col in columns:
    le=LabelEncoder()
    df[col]=le.fit_transform(df[col])
    label_encoders[col]=le
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2,2,1,1,7,2,0,False
1,1,1,0,38.0,1,0,71.2833,0,0,2,0,2,0,1,False
2,1,3,0,26.0,0,0,7.9250,2,2,2,0,7,2,1,True
3,1,1,0,35.0,1,0,53.1000,2,0,2,0,2,2,1,False
4,0,3,1,35.0,0,0,8.0500,2,2,1,1,7,2,0,True

values are converted to numerical form

Now Cheaking Missing Values

In [7]:
df.isnull().sum().sort_values(ascending=False)

age            177
pclass           0
survived         0
sex              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck             0
embark_town      0
alive            0
alone            0
dtype: int64

In [8]:
# using KNN Imputer to fill missing values
from sklearn.impute import KNNImputer
imputer=KNNImputer(n_neighbors=5)

df['age']=imputer.fit_transform(df[['age']])

df.isnull().sum().sort_values(ascending=False)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

data is cleaned using K nearest Neighbour Algorithm

now convert data set back in original form

In [9]:
for col in columns:
    le=label_encoders[col]
    df[col]=le.inverse_transform(df[col])
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

data is converted back in orignal form